Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/services/debug.po
Languages: fr

source: How To Debug ZOO Services
fr: Comment debugger les services ZOO

source: There are different ways to debug your services, the most used solutions are via web or via command line.
fr: Il ya différentes moyens de débugger vos services, les solutions les plus utilisées sont via le web ou via la ligne de commande.

source: Using the web request you can see any problem in the log file of Apache.
fr: En utilisant la requête Web, vous pouvez voir n'importe quel problème dans le fichier de log d'Apache.

source: On Unix system the log file is usually in ``/var/log/apache2`` and the relevant file is ``error_log``. A simple way to read the file is to use the ``tail`` command, it permits to see the update of the file for each request ::
fr: Sur les systèmes Unix, le fichier de log est habituellement dans ``/var/log/apache2`` et le fichier correspondant est ``error_log``. Une manière simple de lire le fichier est d'utiliser la commande ``tail``, cela permet de voir la mise à jour du fichier pour chaque requête ::

source: If the log is not clear enough you can add some more debug information to your code. You have to write to standard error.
fr: Si le log n'est pas assez clair, vous pouvez ajouter un peu plus d'informations de débuggage à votre code. Vous devez écrire dans la sortie d'erreur standard.

source: Using Python, you can for example do this
fr: En utilisant Python, vous pouvez par exemple faire ceci

source: You can user ``alert`` to print a string to standard error:
fr: Vous pouvez utiliser ``alert`` pour renvoyer un chaîne dans la sortie d'erreur standard:

source: If you try to pass an object it will only return ``[object Object]``
fr: Si vous essayez de passer un objet, il ne retournera que ``[object Object]``

source: Command line
fr: Ligne de commande

source: It is possible to use the ZOO kernel ``zoo_loader.cgi`` also from command line. This is really useful to debug in a deeper way your service:
fr: Il est aussi possible d'utiliser le ``zoo_loader.cgi`` du Kernel ZOO depuis la ligne de commande. C'est très utile pour debugger de manière approfondie votre service:

source: Working this way you can use the standard debug system of the actual programming language used to develop your service.
fr: En travaillant de cette façon, vous pouvez utiliser le système de débuggage standard du langage de programmation réelle utilisé pour développer votre service.

source: From command line you can use also the command line tool `GDB <http://www.gnu.org/software/gdb/>`_ to debug ``zoo_loader.cgi``, you have to run:
fr: Depuis la ligne de commande, vous pouvez utiliser l'outil en ligne de commande `GDB <http://www.gnu.org/software/gdb/>`_ pour debugger ``zoo_loader.cgi``, vous devez lancer:

source: At this point you can ask help at the `ZOO mailing list <http://lists.osgeo.org/cgi-bin/mailman/listinfo/zoo-discuss>`_ copying the result of the command.
fr: A ce moment, vous pouvez demander de l'aide sur la `liste de diffusion ZOO <http://lists.osgeo.org/cgi-bin/mailman/listinfo/zoo-discuss>`_ en copiant le résultat de la commande.

source: For Python, you can use ``pdb``, more info at http://docs.python.org/2/library/pdb.html
fr: Pour Python, vous pouvez utiliser ``pdb``, plus d'informations sur http://docs.python.org/2/library/pdb.html

source: You can use ``alert`` also to print in the console, more info in the :ref:`web_javascript` web section
fr: Vous pouvez utiliser ``alert`` aussi pour faire un retour dans la console, plus d'informations dans la section web :ref:`web_javascript`
