Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/services/examples.po
Languages: fr

source: Service Examples
fr: Exemples de services

source: ZOO Services are quite easy to create once you have installed the ZOO Kernel and have chosen code (in the language of your choice) to turn into a ZOO service. Here are some HelloWorlds with links to their corresponding ``.zcfg`` files.
fr: Les services ZOO sont très faciles à créer une fois que vous avez installé le Kernel ZOO et avez choisi le code (dans le langage de votre choix) à transformer pour produire un service ZOO. Voici quelques HelloWorld avec les liens vers leurs fichiers ``.zcfg`` correspondants.

source: Table of Contents
fr: Table des matières

source: GDAL ZOO Service
fr: Service ZOO GDAL

source: The GDAL ZOO Service is based on GDAL source code and copyright. This ZOO Service aims to provide some basic raster processing operations to your ZOO Kernel installation. Learn more and read documentation on the official `GDAL website <http://www.gdal.org/>`__.
fr: Le Service ZOO GDAL est basé sur le code source et le copyright de GDAL. Ce service ZOO a pour but de fournir certaines opérations de base de traitement raster à votre installation du Kernel ZOO. Apprenez en plus et lisez la documentation sur le `site web GDAL <http://www.gdal.org/>`__ officiel.

source: Implemented functions
fr: Fonctions implémentées

source: creates regular grid from the scattered data
fr: créé des grilles régulières depuis des données dispersées

source: converts raster data between different formats
fr: convertit des données raster entre différents formats

source: OGR ZOO Service
fr: Service ZOO OGR

source: The OGR ZOO Service is based on OGR source code and copyright. This ZOO Service aims to provide some basic vector spatial operations to your ZOO Kernel installation. Learn more and read documentation on the official `OGR website <http://www.gdal.org/ogr/index.html>`__.
fr: Le Service ZOO OGR est basé sur le code source et le copyright de OGR. Ce service ZOO a pour but de fournir certaines opérations spatiales vecteur de base à votre installation du Kernel ZOO. Apprenez en plus et lisez la documentation sur le `site web OGR <http://www.gdal.org/>`__ officiel.
