Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/services/howtos.po
Languages: fr

source: How To Setup ZOO Services
fr: Comment configurer des services ZOO

source: ZOO Services are quite easy to create once you have installed the ZOO Kernel and have chosen code (in the language of your choice) to turn into a ZOO service. Here are some HelloWorlds in Python, PHP, Java and JavaScript with links to their corresponding ``.zcfg`` files.
fr: Les services ZOO sont très faciles à créer une fois que vous avez installé le Kernel ZOO et avez choisi le code (dans le langage de votre choix) à transformer pour produire un service ZOO. Voici quelques HelloWorld en Python, PHP, Java et JavaScript avec les liens vers leurs fichiers ``.zcfg`` correspondants.

source: Table of Contents
fr: Table des matières

source: Common informations
fr: Informations communes

source: The function of the process for each programming language take three arguments: the main configuration, inputs and outputs.
fr: La fonction du traitement pour chaque langage de programmation prend trois arguments: la configuration principale, les entrées et sorties.

source: The service has to **return 3 if the process run successfully instead it return 4** if the process end with an error.
fr: Le service doit **retourner 3 si le traitement se passe avec succès et sinon il retourne 4** si le traitement se termine avec une erreur.

source: You'll find here information needed to deploy your own Python Services Provider.
fr: Vous trouverez ici les informations nécessaires pour déployer votre propre fournisseur de services Python.

source: Python ZCFG requirements
fr: Prérquis ZCFG Python

source: For each Service provided by your ZOO Python Services Provider, the ZCFG File must be named the same as the Python module function name (also the case of characters is important).
fr: Pour chaque service fourni par votre fournisseur de services ZOO Python, le fichier ZCFG doit être nommé avec le même nom que celui de la fonction Python (la casse des caractères est importante également).

source: The ZCFG file should contain the following :
fr: Le fichier ZCFG devrait contenir ce qui suit :

source: The name of the Python module to use as a ZOO Service Provider. For instance, if your script, located in the same directory as your ZOO Kernel, was named ``my_module.py`` then you should use ``my_module`` (the Python module name) for the serviceProvider value in ZCFG file.
fr: Le nom du module Python à utiliser comme un fournisseur de services ZOO. Par exemple, si votre script, situé dans le même répertoire que votre ZOO Kernel, a été nommé ``my_module.py`` alors vous devriez utiliser ``my_module`` (le nom du module Python) pour la valeur de serviceProvider dans le fichier ZCFG.

source: Python Data Structure used
fr: Structure de données Python utilisée

source: The three parameters of the function are passed to the Python module as dictionaries.
fr: Les trois paramètres de la fonction sont passés au module Python en tant que dictionnaires.

source: Following you'll find an example for each parameters
fr: Après, vous trouverez un exemple pour chacun des paramètres

source: Main configuration
fr: Configuration principale

source: Main configuration contains several informations, some of them are really useful to develop your service. Following an example ::
fr: La configuration principale contient plusieurs informations, certaines d'entre elles sont vraiment utiles pour développer votre service. A la suite par exemple ::

source: Inputs
fr: Entrées

source: The inputs are somethings like this ::
fr: Les entrées sont quelque chose comme ça ::

source: The access to the value you have to require for the ``value`` parameter, something like this ::
fr: L'accès à la valeur que vous avez à demander pour le paramètre ``value``, doit ressembler à quelque chose comme ceci ::

source: Outputs
fr: Sorties

source: The outputs data as a structure really similar to the inputs one ::
fr: La donnée de sorties a une structure très similaire à celle en entrée ::

source: There is no ``'value'`` parameter before you assign it ::
fr: Il n'y a pas de paramètre ``'value'`` avant que vous ne l'assignez ::

source: The return statement has to be an integer: corresponding to the service status code.
fr: La déclaration de retour doit être un entier correspondant au code d'état de service.

source: To add a message for the wrong result you can add the massage to ``conf["lenv"]["message"]``, for example:
fr: Pour ajouter un message pour le mauvais résultat, vous pouvez ajouter le message ``conf["lenv"]["message"]``, par exemple:

source: Sample ZOO Python Services Provider
fr: Fournisseur de service Python ZOO exemple

source: The following code represents a simple ZOO Python Services Provider which provides only one Service, the HelloPy one.
fr: Le code suivant représente un fournisseur de services Python ZOO simple qui fournit un seul service, celui de HelloPy.

source: ZOO API
fr: API ZOO

source: If you need to use :ref:`ZOO API <api>` in your service, you have first to copy ``zoo-api.js`` and ``zoo-proj4js.js`` where your services are located (for example in Unix system probably in ``/usr/lib/cgi-bin/``
fr: Si vous avez besoin d'utiliser :ref:`l'API ZOO <api>` dans votre service, vous devez d'abord copier ``zoo-api.js`` et ``zoo-proj4js.js`` où les vos services sont situés (par exemple dans un système Unix system probablement dans ``/usr/lib/cgi-bin/``)

source: Javascript ZCFG requirements
fr: Prérquis ZCFG Javascript

source: For each Service provided by your ZOO Javascript Services Provider, the ZCFG File must be named the same as the Javascript function name (also the case of characters is important).
fr: Pour chaque service fourni par votre fournisseur de services ZOO Javascript, le fichier ZCFG doit être nommé avec le même nom que celui de la fonction Javascript (la casse des caractères est importante également).

source: The name of the JavaScript file to use as a ZOO Service Provider. For instance, if your script, located in the same directory as your ZOO Kernel, was named ``my_module.js`` then you should use ``my_module.js``.
fr: Le nom du fichier JavaScript à utiliser comme fournisseur de services ZOO. Par exemple, si votre script, situé dans le même répertoire que votre ZOO Kernel, a été nommé ``my_module.js`` alors vous devriez utiliser ``my_module.js``.

source: Javascript Data Structure used
fr: Structure de données Javascript utilisée

source: The three parameters of the function are passed to the JavaScript function as Object.
fr: Les trois paramètres de la fonction sont passés à la fonction JavaScript en tant qu'objet.

source: Sample ZOO Javascript Services Provider
fr: Fournisseur de service Javascript ZOO exemple
