Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/services/zcfg-reference.po
Languages: fr

source: ZCFG : the ZOO Service Configuration File
fr: ZCFG : le fichier de configuration de service ZOO

source: Table of Contents
fr: Table des matières

source: The ZOO Service configuration file (.zcfg) describes the service and will be parsed by the ZOO Kernel. We will describe here what such a file contains. You can also take a look at the existing examples of ZCFG files in the ``cgi-env`` directory of each services available in the `ZOO-Project SVN source tree <http://zoo-project.org/trac/browser/trunk/zoo-services>`__.
fr: Le fichier de configuration de service ZOO (.zcfg) deécrit le service et sera parsé par le Kernel ZOO. Nous décrirons ici ce qu'un tel fichier contient. Vous pouvez aussi jeter un oeil aux exemples existants de fichiers ZCFG dans le répertoire ``cgi-env`` de chaque service disponible dans `l'arborescence des sources SVN du projet ZOO <http://zoo-project.org/trac/browser/trunk/zoo-services>`__.

source: A ZOO Configuration file is divided into three distinct sections :
fr: Un fichier de configuration ZOO est divisé en trois sections distinctes :

source: Main Metadata information
fr: Information de métadonnée principale

source: List of Inputs metadata information
fr: Liste des Information de métadonnée en entrées

source: List of Outputs metadata information
fr: Liste des Information de métadonnée en sorties

source: The ZOO Service Configuration File is case sensitive.
fr: Le fichier de configuration de service ZOO est sensible à la casse.

source: Main Metadata Information
fr: Information de métadonnée principale

source: The fist part in a ZOO Configuration file contains the metadata information relative to the service. Note that the "name of your service" between brackets on the first line has to be the exact same name as the function you defined in your services provider code. In most cases, this name is also the name of the ZCFG file without the "``.zcfg``" extension.
fr: La première partie d'un fichier de configuration ZOO contient l'information de métadonnée relative au service. Notez que le "name of your service" entre crochets sur la première ligne doit avoir un nom exactement le même que celui de la fonction que vous avez défini dans votre code de fournisseur de services. Dans la plupart des cas, ce nom est aussi le nom du fichier ZCFG sans l'extension "``.zcfg``".

source: You can see below a description of the main metadata information:
fr: Vous pouvez voir ci-dessous une description de l'information de métadonnée principale:

source: List of Inputs
fr: Liste des entrées

source: The list of inputs contains metadata information of each supported input, and they are grouped using a ``<DataInputs>`` node.
fr: La liste des entrées contient l'informations de métadonnée de chaque entrée supportée, et elles sont groupées en utilisant un noeud ``<DataInputs>``.

source: Each input is defined as :
fr: Chaque entrée est définie comme :

source: a name (between brackets as for the name of the service before)
fr: un nom (entre crochets comme pour le nom du service avant)

source: various medata properties (``Title``, ``Abstract``, ``minOccurs`` and ``maxOccurs``)
fr: diverse propriétés de métadonnée (``Title``, ``Abstract``, ``minOccurs`` et ``maxOccurs``)

source: a Type Of Data node (:ref:`description <typeDataNodes>`)
fr: un type de noeud de donnée (:ref:`description <typeDataNodes>`)

source: A typical list of inputs (``<DataInputs>``) look like the following:
fr: Une liste d'entrées typique (``<DataInputs>``) ressemble à ce qui suit:

source: you can add ``<MetaData>`` node as in the main metadata information.
fr: vous pouvez ajouter un noeud ``<MetaData>`` comme dans l'information de métadonnée principale.

source: List of Outputs
fr: Liste des sorties

source: The list of outputs is very similar to a list of inputs except it is specified as a ``<DataOutputs>`` node.
fr: TLa liste des sorties est très similaire à un liste d'entrées exceptée qu'elle est spécifiée comme un noeud ``<DataOutputs>``.

source: A typical ``<DataOutputs>`` node looks like the following:
fr: Un noeud ``<DataOutputs>``typique ressemble à ce qui suit:

source: Type Of Data Nodes
fr: Type de noeud de données

source: In the beginning of this ZCFG introduction, we spoke about "Type Of Data Nodes" to describe the data type of inputs and outputs.
fr: Au début de cette introduction sur les ZCFG, nous avons parlé du "Type de noeud de données" pour décrire le type de données des entrées et des sorties.

source: You can define your data as:
fr: Vous pouvez définir votre donnée comme:

source: Except for ``LiteralData``, each *Type Of Data* node must have at least one ``<Default>`` and one ``<Supported>`` node. Even if one of those are empty, it **has to be present** with an opening and closing tag on two different lines. So, something like the following:
fr: Excepté pour ``LiteralData``, chaque noeud du *type de donnée* doit avoir au moins un noeud ``<Default>`` et un noeud ``<Supported>``. Même si l'un d'eux est vide, il **doit être présent** avec un tag ouvrant et fermant sur deux différentes lignes. Donc, quelque chose comme ce qui suit:

source: Otherwise, ZOO-Kernel won't be able to parse your ZCFG and will fail to process requests.
fr: Autrement, le ZOO-Kernel ne sera pas capable de parser votre ZCFG et échouera à traiter les requêtes.

source: LiteralData node
fr: Noeud LiteralData

source: A ``<LiteralData>`` node contains:
fr: Un noeud ``<LiteralData>`` contient:

source: one ``<Default>`` node,
fr: une noeud ``<Default>``,

source: zero or more ``<Supported>`` nodes depending on the existence or the number of supported Units Of Measure (UOM), and
fr: zéro noeud ``<Supported>`` ou plus en fonction de l'existence ou du nombre d'unités de mesures (UOM), et

source: a ``dataType`` property. The ``dataType`` property defines the type of literal data, such as a string, an interger and so on (consult `the complete list <http://www.w3.org/TR/xmlschema-2/#built-in-datatypes>`__ of supported data types).
fr: de la propriété ``dataType``. La propriété ``dataType`` définit le type de la donnée litérale, comme une chaîne, un entier et ainsi de suite (consultez `la liste complète <http://www.w3.org/TR/xmlschema-2/#built-in-datatypes>`__ des types de données supportées).

source: ``<Default>`` and ``<Supported>`` nodes can contain the ``uom`` property to define which UOM has to be used for this input value.
fr: Les noeuds ``<Default>`` et ``<Supported>`` peuvent contenir la propriété ``uom``pour définir quel UOM (Unité de mesure) doit être utilisée pour cette valeur en entrée.

source: For input ``<LiteralData>`` nodes, you can add the ``value`` property to the ``<Default>`` node to define a default value for this input. This means that, when your Service will be run, even if the input wasn't defined, this default value will be set as the current value for this input.
fr: Pour des noeuds ``<LiteralData>`` en entrée, vous pouvez ajouter la propriété ``value`` au noeud ``<Default>`` pour définir une valeur par défaut pour cette entrée. Cela signifie que, quand votre service sera lancé, même si l'entrée n'a pas été définie, cette valeur par défaut sera définie comme la valeur courante pour cette entrée.

source: A typical ``<LiteralData>`` node, defining a ``float`` data type using meters or degrees for its UOM, looks like the following:
fr: Un noeud ``<LiteralData>`` typique, définissant un type de donnée ``float``en utilisant des mètres ou des degrés pour ses UOM, ressemble à ce qui suit:

source: BoundingBoxData node
fr: Noeud BoundingBoxData

source: A ``<BoundingBoxData>`` node contains:
fr: Un noeud ``<BoundingBoxData>`` contient:

source: one ``<Default>`` node with a CRS property defining the default Coordinate Reference Systems (CRS), and
fr: un noeud ``<Default>`` avec une propriété CRS définissant le système de référence de coordonnées par défaut (CRS), et

source: one or more ``<Supported>`` nodes depending on the number of CRS your service supports (note that you can alternatively use a single ``<Supported>`` node with a comma-separated list of supported CRS).
fr: un noeud ``<Supported>`` ou plus en fonction du nombre de CRS que votre service supporte (notez que vous pouvez alternativement utiliser un seul noeud ``<Supported>`` avec une liste séparée par des virgules des CRS supportés).

source: A typical ``<BoundingBoxData>`` node, for two supported CRS (`EPSG:4326 <http://www.epsg-registry.org/indicio/query?request=GetRepositoryItem&id=urn:ogc:def:crs:EPSG::4326>`__ and `EPSG:3785 <http://www.epsg-registry.org/indicio/query?request=GetRepositoryItem&id=urn:ogc:def:crs:EPSG::3785>`__), looks like the following:
fr: Un noeud ``<BoundingBoxData>`` typique, pour deux CRS supportés (`EPSG:4326 <http://www.epsg-registry.org/indicio/query?request=GetRepositoryItem&id=urn:ogc:def:crs:EPSG::4326>`__ et `EPSG:3785 <http://www.epsg-registry.org/indicio/query?request=GetRepositoryItem&id=urn:ogc:def:crs:EPSG::3785>`__), ressemble à ce qui suit:

source: ComplexData node
fr: Noeud ComplexData

source: A ComplexData node contains:
fr: Un noeud ComplexData contient:

source: a ``<Default>`` node and
fr: un noeud ``<Default>`` et

source: one or more ``<Supported>`` nodes depending on the number of supported formats. A format is made up of this set of properties : ``mimeType``, ``encoding`` and optionaly ``schema``.
fr: un ou plusieurs noeuds ``<Supported>`` en fonction du nombre de formats supportés. Un format est Un format est constitué de ce jeu de propriétés: ``mimeType``, ``encoding`` et optionnellement ``schema``.

source: For output ComplexData nodes, you can add the ``extension`` property to define what extension to use to name the file when storing the result is required. Obviously, you'll have to add the ``extension`` property to each supported format (for the ``<Default>`` and ``<Supported>`` nodes).
fr: Pour des noeuds ComplexData en sortie, vous pouvez ajouter la propriété ``extension`` pour définir quelle extension à utiliser pour nommer le fichier quand le stockage du résultat est requis. Evidemment, vous devrez ajouter la propriété ``extension`` à chacun des formats supportés (pour les noeuds ``<Default>`` et ``<Supported>``).

source: You can also add the ``asReference`` property to the ``<Default>`` node to define if the output should be stored on server side per default.
fr: Vous pouvez aussi ajouter la propriété ``asReference`` au noeud ``<Default>`` pour définir si la sortie doit être stockée sur la partie serveur par défaut.

source: the client can always modify this behavior by setting ``asReference`` attribute to ``true`` or ``false`` for this output in the request ``ResponseDocument`` parameter.
fr: la client peut toujours modifier le comportement en configurant l'attribut ``asReference`` à ``true`` ou ``false`` pour cette sortie dans le paramètre ``ResponseDocument`` de la requête.

source: You can see below a sample ComplexData node for default ``application/json`` and ``text/xml`` (encoded in UTF-8 or base64) mimeTypes support:
fr: Vous pouvez voir ci-dessous un exemple de noeud ComplexData pour le support des mimeTypes par défaut ``application/json`` et ``text/xml`` (encodé en UTF-8 ou base64):
