Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/development/documentation.po
Languages: fr

source: Documentation Development Guide
fr: Guide de développement de la documentation

source: Table of Contents
fr: Table des matières

source: Background
fr: Contexte

source: The current structure of the ZOO Project documentation process is for developers with :ref:`SVN <svn>` commit access to maintain their documents in reStructuredText format, and therefore all documents live in the /docs directory in SVN. The `Sphinx <http://sphinx.pocoo.org/>`__ documentation generator is used to convert the reStructuredText files to html, and the live website is then updated on an hourly basis.
fr: La structure actuelle du processus de documentation du projet ZOO est pour les développeurs avec les accès :ref:`SVN <svn>` de commit pour maintenir leurs documents en format reStructuredText, et donc tous les documents vivent dans le répertoire /docs dans le SVN. Le genérateur de documentation `Sphinx <http://sphinx.pocoo.org/>`__ est utilisé pour convertir les fichiers ReStructuredText en html, et le site en ligne est ensuite mis à jour sur une base horaire.

source: reStructuredText Reference Guides
fr: Guides de référence du reStructuredText

source: Docutils `Quick reStructuredText <http://docutils.sourceforge.net/docs/user/rst/quickref.html>`__
fr: le `reStructuredText rapide <http://docutils.sourceforge.net/docs/user/rst/quickref.html>`__ de Docutils

source: Docutils `reStructuredText Directives <http://docutils.sourceforge.net/docs/ref/rst/directives.html>`__
fr: les `directives reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/directives.html>`__ de Docutils

source: Sphinx's `reStructuredText Primer <http://sphinx.pocoo.org/rest.html>`__
fr: le `livre de base du StructuredText <http://sphinx.pocoo.org/rest.html>`__ de Sphinx

source: search Sphinx's `mailing list <http://groups.google.com/group/sphinx-dev>`__
fr: cherchez dans la `liste de diffusion <http://groups.google.com/group/sphinx-dev>`__ de Sphinx

source: reStructuredText Formatting
fr: Formatage du reStructuredText

source: All text should be hard breaks at or around the 80 column mark, just as the source code.
fr: Tout le texte doit être coupé avant que les lignes ne fassent environ plus de 80 caractères, comme pour le code source.

source: Installing and Using Sphinx for rst-html Generation
fr: Installation et utilisation de Sphinx pour la génération rst-html

source: You can browse the versions of the Sphinx packages `here <http://pypi.python.org/pypi?%3Aaction=index>`__, and then install the exact version such as:
fr: Vous pouvez naviguer dans les versions des paquets Sphinx `ici <http://pypi.python.org/pypi?%3Aaction=index>`__, et ensuite installez la version exacte comme ceci:

source: **On Windows:**
fr: **sous Windows:**

source: install `Python 2.X <http://www.python.org/>`__
fr: installez `Python 2.X <http://www.python.org/>`__

source: download `setuptools <http://pypi.python.org/pypi/setuptools#windows>`__
fr: téléchargez `setuptools <http://pypi.python.org/pypi/setuptools#windows>`__

source: make sure that the ``C:/Python2X/Scripts`` directory is your path
fr: assurez vous que le répertoire ``C:/Python2X/Scripts`` est dans le Path

source: execute the following at commandline:
fr: exécutez ce qui suit dans la ligne de commande:

source: ...you should see message: "Finished processing dependencies for Sphinx"
fr: ...vous devriez voir le message : "Finished processing dependencies for Sphinx"

source: Make sure you install Sphinx 1.0 or more recent. See note above.
fr: Assurez vous d'installer Sphinx 1.0 ou plus récent. Voir les notes ci-dessus.

source: install `MiKTeX <http://miktex.org>`__ if you want to build pdfs
fr: installez `MiKTeX <http://miktex.org>`__ si vous souhaitez générer des pdfs

source: checkout the /docs directory from SVN, such as:
fr: récupérez le répertoire /docs depuis le SVN, comme ceci:

source: inside the /docs directory, execute:
fr: dans le répertoire /docs, exécutez:

source: or
fr: ou

source: the HTML output will be written to the _build/html sub-directory.
fr: ou

source: **On Linux:**
fr: **Sous Linux:**

source: make sure you have the Python dev and setuptools packages installed. On Ubuntu:
fr: assurez-vous d'avoir les paquets de développement Python et setuptools installés. Sous Ubuntu:

source: install sphinx using easy_install:
fr: installez sphinx en utilisant easy_install:

source: to process the docs, from the ZOO /docs directory, run:
fr: pour générer la documentation, depuis votre répertoire /docs ZOO, lancez:

source: the HTML output will be written to the build/html sub-directory.
fr: la sortie HTML sera écrite dans le sous-répertoire build/html.

source: If there are more than one translation, the above commands will automatically build all translations.
fr: S'il y a plus d'une seule traduction, les commandes ci-dessus généreront automatiquement toutes les traductions.

source: **On Mac OS X:**
fr: **Sous Mac OS X:**

source: install `MacTex <http://www.tug.org/mactex/2009/>`__ if you want to build pdfs
fr: installez `MacTex <http://www.tug.org/mactex/2009/>`__ si vous voulez générer les pdfs
