Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/community/irc.po
Languages: fr

source: Some of the development of the ZOO-Project is coordinated through IRC. This page describes how you log on to chat, ask questions, and hack around with the developers.
fr: Une partie du développement du ZOO-Project est coordonnée via IRC. Cette page décrit comment vous connecter au chat, poser des questions et hacker avec les développeurs.

source: Server and Channel Information
fr: Serveur et canal d'information

source: Why IRC?
fr: Pourquoi l'IRC?

source: IRC is a primary medium where Open Source GIS hackers congregate, collaborate, and hack. It makes it easy to communicate things like compilation issues, where immediate, iterative feedback allows folks to make a lot of progress. Something that might take days of heavily-quoted emails through a mailinglist might only take fifteen minutes on IRC.
fr: L'IRC est un des premiers lieux où les hackers SIG Open Source se rassemblent, collaborent et hackent. Cela rend facile de communiquer des choses comme des problèmes de compilation, où une retour immédiat et itératif permet aux gens de beaucoup progresser. Quelque chose qui pourrait prendre des jours d'échanges très nourris par email via une liste de diffusion peut ne nécessiter parfois qu'une quinzaine de minutes via IRC.

source: IRC is a great way to coordinate on-line meetings. The ZOO PSC conducts their monthly meetings through IRC.
fr: L'IRC est un excellent moyen de coordonner les réunions en ligne. Le PSC du ZOO mène ces réunions mensuelles par IRC.

source: How do I join?
fr: Comment puis-je m'inscrire?

source: `Chatzilla <http://chatzilla.hacksrus.com/>`__ is probably the easiest way to get going. Chatzilla works with Mozilla or Firefox, and once you have it installed, you can log on to the channel by pointing your browser at::
fr: `Chatzilla <http://chatzilla.hacksrus.com/>`__ est probablement la meilleure façon d'y accéder. Chatzilla fonctionne avec Mozilla ou Firefox, et une fois que vous l'avez installé, vous pouvez vous connecter sur le canal en pointant votre navigateur sur::

source: There are many other IRC clients available. `This page <http://tikiwiki.org/ConnectingToIrc>`__ provides a good listing for many different platforms.
fr: Il existe de nombreux autres clients IRC disponibles. `Cette page <http://tikiwiki.org/ConnectingToIrc>`__ fournit une bonne liste pour de nombreuses plates-formes différentes.

source: You can also connect to IRC directly in your Web browser without a client:
fr: Vous pouvez aussi vous connecter à l'IRC directement dans votre navigateur Web sans un client:

source: goto http://webchat.freenode.net/
fr: Allez sur http://webchat.freenode.net/

source: enter a nickname (usually your first initial plus your last name)
fr: entrez un pseudo (généralement l'initiale de votre prénom suivi de votre nom de famille)

source: in "Channels" enter: zoo-project
fr: dans "Channels" entrez: zoo-project

source: Connect!
fr: Connectez-vous!

source: IRC logs
fr: Logs IRC

source: It is possible to see the logs (history) of ZOO-Project IRC channel `here <http://svn.zoo-project.org/irc/>`_
fr: Il est possible de voir les logs (l'historique) du canal IRC du ZOO-Project `ici <http://svn.zoo-project.org/irc/>`_
