Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/kernel/install-prerequisites.po
Languages: fr

source: Prerequisites
fr: Prérequis

source: Table of Contents
fr: Table des matières

source: Obtaining the ZOO Kernel Source
fr: Obtenir les sources du Kernel ZOO

source: Use the following command to get the ZOO Kernel source code through Subversion:
fr: Utilisez la commande suivante pour obtenir le code source du Kernel ZOO via Subversion:

source: For users which get a developer account, use the following:
fr: Pour les utilisateurs qui ont un compte développeur, utilisez ce qui suit:

source: The first line of the instruction above defines a specific tunnel to access the svn server through the SSH protocol. Indeed, the ZOO SVN server listens on the 1046 (1024+22) port rather than the default one (22).
fr: La première line d'instruction ci-dessus définit un tunnel spécifique pour accéder au serveur svn via le protocole SSH. En effet, le serveur SVN ZOO écoute sur le port 1046 (1024+22) plutôt que sur celui par défaut (22).

source: The following libraries are required on your system before you can install the ZOO Kernel:
fr: Les bibliothèques suivantes sont requises sur votre système avant que pouviez installer le Kernel ZOO:

source: Optional libraries include:
fr: Les bibliothèques optionnelles recouvrent:

source: MapServer (optional for WMS, WFS and WCS output) ( http://mapserver.org )
fr: MapServer (optionnel pour les sorties WMS, WFS et WCS) ( http://mapserver.org )

source: PHP Embedded (optional) ( http://www.php.net )
fr: PHP encapsulé (optionnel) ( http://www.php.net )

source: Java SDK (optional) ( http://java.sun.com )
fr: SDK Java (optionnel) ( http://java.sun.com )

source: SpiderMonkey (optional) ( http://www.mozilla.org/js/spidermonkey/ )
fr: SpiderMonkey (optionnel) ( http://www.mozilla.org/js/spidermonkey/ )

source: Compile libcgic
fr: Compiler libcgic

source: The first step is to compile libcgic from the ``zoo-project/thirds`` directory. For such a task, please use the following command:
fr: La première étape est de compiler libcgic depuis le répertoire ``zoo-project/thirds``. Pour cette tâche, merci d'utiliser la commande suivante:

source: Make sure that a ``libcgic.a`` is created in your ``zoo-project/thirds/cgic206`` directory. If yes, then you can go to the next step.
fr: Assurez-vous que ``libcgic.a`` est créé dans votre répertoire ``zoo-project/thirds/cgic206``. Si oui, alors vous pouvez passer à l'étape suivante.

source: On Windows, rather than using the make command, please use:
fr: Sous Windows, plutôt que d'utiliser la commande make, merci d'utiliser:

source: If you don't compile libcgic first, and try to compile the ZOO Kernel, you will get an error such as *cannot find -lcgic*
fr: Si vous ne compilez pas libcgic en premier et essayez de compiler le Kernel ZOO, vous aurez une erreur du type *cannot find -lcgic*
