Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/kernel/install-windows.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: Using OSGeo4W
fr: Utiliser OSGeo4W

source: Install OSGeo4W
fr: Installer OSGeo4W

source: Download the OSGeo4W installer from http://trac.osgeo.org/osgeo4w/, and install it with all the dependencies needed by your services (GDAL/OGR for example). The following libs are required: FastCGI, libxml, Python, cURL.
fr: Téléchargez l'installateur OSGeo4W depuis http://trac.osgeo.org/osgeo4w/, et l'installer avec toutes les dépendances nécessaires à vos services (GDAL/OGR par exemple). Les bibliothèques suivantes sont requises: FastCGI, libxml, Python, cURL.

source: Install other tools and libraries
fr: Installer les autres outils et bibliothèques

source: After installing OSGeo4W on your platform you'll need more GNU tools and libraries. `This package <http://www.zoo-project.org/dl/tool-win32.zip>`__ contains full dependencies required to compile on WIN32 platform and this one contains `full runtime dependencies to place <http://www.zoo-project.org/dl/zoo-runtime.zip>`__ in your c:\OSGeo4W\bin.
fr: Après l'installation de OSGeo4W sur votre plate-forme, vous aurez besoin de plus d'outils et bibliothèques GNU. `Ce paquet <http://www.zoo-project.org/dl/tool-win32.zip>`__ contient toutes les dépendances requises pour compiler sur les plates-formes WIN32 et celui-ci contient toutes `les dépendances pour l'exécution à placer <http://www.zoo-project.org/dl/zoo-runtime.zip>`__ dans votre c:\OSGeo4W\bin.

source: Download and Install ZOO Kernel
fr: Télécharger et installer le Kernel ZOO

source: Download the `binary version <http://www.zoo-project.org/dl/zoo_loader.cgi>`__ of the ZOO Kernel for WIN32 then place it in the ``C:\OSGeo4W\bin`` directory. Don't forget to place a ``main.cfg`` file in the same directory, you can use a modified copy of `this file <http://www.zoo-project.org/trac/browser/trunk/zoo-kernel/main.cfg>`__.
fr: Téléchargez `la version binaire <http://www.zoo-project.org/dl/zoo_loader.cgi>`__ du Kernel ZOO pour WIN32 ensuite placez-la dans le répertoire ``C:\OSGeo4W\bin``. N'oubliez pas de placer un fichier ``main.cfg`` dans le même répertoire, vous pouvez utiliser une copie modifiée de `ce fichier <http://www.zoo-project.org/trac/browser/trunk/zoo-kernel/main.cfg>`__.

source: Deploy ZOO Services Providers
fr: Déployer les fournisseurs de services ZOO

source: Your can use the binary version of the OGR Services Provider available from `here <http://www.zoo-project.org/dl/zoo-services-win32.zip>`__. Then place the two libraries with their respective .zcfg files in your local ``C:\OSGeo4W\bin`` directory.
fr: Vous pouvez utiliser la version binaire du fournisseur de services OGR disponible depuis `ici <http://www.zoo-project.org/dl/zoo-services-win32.zip>`__. Ensuite, placez les deux bibliothèques avec leurs fichiers .zcfg respectifs dans votre répertoire ``C:\OSGeo4W\bin`` local.

source: Testing
fr: Tester

source: Now you should be able to query your local ZOO Kernel.
fr: Maintenant, vous devriez être capable de faire une requête vers votre Kernel ZOO local.

source: Compiling Using Your Own Libraries
fr: Compiler en utilisant vos propres bibliothèques

source: You must be sure to perform the :ref:`prerequisite steps <kernel-installation-prereq>` before compiling the ZOO Kernel.
fr: vous devez être sûr d'avoir effectué les :ref:`étapes de prérequis <kernel-installation-prereq>` avant la compilation du Kernel ZOO.

source: The following steps are for use with the Microsoft Visual Studio compiler (and tested with MSVC 2008).
fr: Les étapes suivantes sont pour être utiliser avec le compilateur Visual Studio de Microsoft (et testé avec MSVC 2008).

source: Make sure the gnuwin32 tools ``bison.exe`` and ``flex.exe`` are found in your path. You can download the GNUwin32 tools `here <http://www.zoo-project.org/dl/tool-win32.zip>`__.
fr: Assurez-vous que les outils gnuwin32 ``bison.exe`` et ``flex.exe`` sont trouvés dans le chemin. Vous pouvez télécharger les outils GNUwin32 `ici <http://www.zoo-project.org/dl/tool-win32.zip>`__.

source: Modify the file ``zoo-project\zoo-kernel\nmake.opt`` to point to your local libraries. You can find a modified nmake.opt that points to local libs `here <http://www.zoo-project.org/trac/attachment/ticket/27/nmake.opt>`__. You can also find a modified ``zoo-project\zoo-kernel\makefile.vc`` file `here <http://www.zoo-project.org/trac/attachment/ticket/27/makefile.vc>`__.
fr: Modifiez le fichier ``zoo-project\zoo-kernel\nmake.opt`` to point to your local libraries. You can find a modified nmake.opt that points to local libs `here <http://www.zoo-project.org/trac/attachment/ticket/27/nmake.opt>`__. You can also find a modified ``zoo-project\zoo-kernel\makefile.vc`` file `here <http://www.zoo-project.org/trac/attachment/ticket/27/makefile.vc>`__.

source: Execute:
fr: Exécutez:

source: A file ``zoo_loader.cgi`` should be created. Note that if another file named ``zoo_loader.cgi.manifest`` is also created, you will have to run another command:
fr: Un fichier ``zoo_loader.cgi`` devrait être créé. Notez que si un autre fichier nommé ``zoo_loader.cgi.manifest`` est aussi créé, vous aurez à lancer une autre commande:

source: Copy the files ``zoo_loader.cgi`` and ``main.cfg`` into your cgi-bin directory.
fr: Copiez les fichiers ``zoo_loader.cgi`` et ``main.cfg`` dans votre répertoire cgi-bin.

source: Using the command prompt, test the zoo-kernel by executing the following command:
fr: En utilisant l'invite de commande, testez le zoo-kernel en exécutant la commande suivante:

source: which should display a message such as:
fr: qui devrait afficher un message tel que:

source: Edit the file ``cgi-bin/main.cfg`` so that it contains values describing your WPS service. An example of such a file running on Windows is:
fr: Editez le fichier ``cgi-bin/main.cfg`` afin qu'il contienne les valeurs décrivant votre service WPS. Un exemple d'un fichier tel que cela fonctionnant sur Windows est:

source: Open a web browser window, and execute a GetCapababilites request on your WPS service: http://localhost/cgi-bin/zoo_loader.cgi?request=GetCapabilities&service=WPS
fr: Ouvrez une fenêtre de navigateur web, et exécutez une requête GetCapababilites sur votre service WPS: http://localhost/cgi-bin/zoo_loader.cgi?request=GetCapabilities&service=WPS

source: The response should be displayed in your browser, such as:
fr: La réponse devrait être affichée dans votre navigateur, comme:

source: Optionally Compile Individual Services
fr: Compiler optionnellement les services de manière individuelle

source: An example could be the ``OGR base-vect-ops`` provider in the ``zoo-project\zoo-services\ogr\base-vect-ops`` directory.
fr: Un exemple pourrait être le fournisseur ``OGR base-vect-ops`` dans le répertoire ``zoo-project\zoo-services\ogr\base-vect-ops``.

source: Edit the makefile.vc located in that directory, and execute:
fr: Editez le makefile.vc situé dans ce répertoire, et exécutez:

source: Inside that same directory, the file ``cgi-env\ogr_service.zo`` should be created.
fr: A l'intérieur du même répertoire, le fichier ``cgi-env\ogr_service.zo`` devrait être créé.

source: Copy all of the files inside ``zoo-services\ogr\base-vect-ops\cgi-env`` into your cgi-bin directory
fr: Copiez tous les fichiers dedans ``zoo-services\ogr\base-vect-ops\cgi-env`` dans votre répertoire cgi-bin

source: Test this service provider through the following URL:
fr: Testez ce fournisseur de service via l'URL suivante:

source: The response displayed in your browser should contain:
fr: La réponse affichée dans votre navigateur doit contenir:
