Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/kernel/install-mac.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: Using the Installer
fr: Utiliser l'installateur

source: To install a default build of the ZOO-Project on your Mac OS X computer use the `installer <http://www.zoo-project.org/trac/raw-attachment/wiki/ZooDocumentation/ZOOKernel/MacOSX_installation/ZOO-Project-Installer.pkg>`__.
fr: Pour installer un version compilée par défaut du ZOO-Project sur votre ordinateur Mac OS X, utilisez `l'installateur <http://www.zoo-project.org/trac/raw-attachment/wiki/ZooDocumentation/ZOOKernel/MacOSX_installation/ZOO-Project-Installer.pkg>`__.

source: The installer assumes that you are using the distributed Apache2 version that comes with your Mac. The installer will place ZOO-Kernel and ZOO-Services into your cgi-bin at ``/Library/WebServer/CGI-Executables``, and the zoo-demo folder will be placed within your document root at ``/Library/WebServer/Documents``
fr: Cet installateur suppose que vous utilisez la version Apache 2 de la distribution venant avec votre Mac. L'installateur placera le ZOO-Kernel et le ZOO-Services dans votre cgi-bin dans ``/Library/WebServer/CGI-Executables``, et le répertoire zoo-demo sera placé dans votre racine de document dans ``/Library/WebServer/Documents``

source: Make sure that your Apache server is running, and then access the ZOO Project Demo at:
fr: Assurez-vous que votre serveur Apache fonctionne, et ensuite accédez à la démo du projet ZOO depuis:

source: To add additional services, please follow the following intructions to compile your own ZOO Project instance.
fr: Pour ajouter des services en plus, merci de suivre les instructions suivantes pour compiler votre propre instance du projet ZOO.

source: Compiling from Source
fr: Compiler depuis les sources

source: Install `Xcode <http://developer.apple.com/technologies/tools/>`__.
fr: Installez `Xcode <http://developer.apple.com/technologies/tools/>`__.

source: Before you start downloading the ZOO-Project source code, you'll need to install some tools required to compile ZOO-Kernel properly.
fr: Avant de commencer le téléchargement du code source du ZOO-Project, vous devez installer quelques outils requis pour compiler le ZOO-Kernel correctement.

source: First of all install PROJ, GEOS and GDAL frameworks from `here <http://www.kyngchaos.com/software/frameworks>`__.
fr: En tout premier, installez les frameworks PROJ, GEOS et GDAL depuis `ici <http://www.kyngchaos.com/software/frameworks>`__.

source: At this step, you should get the following directories on your local hard drive :
fr: A cette étape, vous devriez obtenir les répertoires suivants sur votre disque dur local :

source: Then, create a ``src`` directory and inside that directory download the `gettext source code <http://www.gnu.org/software/gettext/#TOCdownloading>`__ and uncompress it.
fr: Ensuite, créez un répertoire ``src`` et à l'intérieur de celui-ci, téléchargez le `code source de gettext <http://www.gnu.org/software/gettext/#TOCdownloading>`__ et décompressez-le.

source: now, compile gettext with the following commands to produce a universal binary :
fr: maintenant, compilez gettext avec les commandes suivantes pour produire un binaire universel :

source: Compile and install your ZOO-Kernel
fr: Compilez et installez votre ZOO-Kernel

source: Download source from SVN, and use the following command to compile libcgic :
fr: Téléchargez les sources depuis SVN, et utilisez la commande suivante pour compiler libcgic :

source: If you produced the ``libcgic.a`` file, you can run ``autoconf`` and then ``configure`` from zoo-kernel directory.
fr: Si vous avez produit le fichier ``libcgic.a``, vous pouvez lancer ``autoconf`` puis ``configure`` depuis le répertoire zoo-kernel.

source: Obviously, if you don't need Python or Java support then you should remove the corresponding configure option.
fr: Evidemment, si vous n'avez pas besoin du support Python ou Java alors vous devriez retirer l'option de configure correspondante.

source: Note that we used the --with-java=macos configure option. Due to the generic location of the JDK on all Mac OS X platforms, you don't have to provide its full path.
fr: Notez que nous utilisons l'option de configure --with-java=macos. En raison de l'emplacement générique du JDK sur toutes les plates-formes Mac OS X, vous n'avez pas à fournir son chemin complet.

source: Now, run the following commands to compile and deploy your ZOO-Kernel on your Apache server :
fr: Maintenant, lancez les commandes suivantes pour compiler et déployer votre ZOO-Kernel sur votre serveur Apache :

source: You should be ready to request your ZOO-Kernel installation using the following link : http://localhost/cgi-bin/zoo_loader.cgi?request=GetCapabilities&service=WPS .
fr: Vous devez être prêt à interroger votre installation du ZOO-Kernel en utilisant le lien suivant : http://localhost/cgi-bin/zoo_loader.cgi?request=GetCapabilities&service=WPS .

source: If everything is ok, you can follow the next steps to deploy new Services Providers.
fr: Si tout est ok, vous pouvez suivre les étapes suivantes pour déployer les nouveaux fournisseurs de services.

source: If you are using your own libs (not the default libs on your system) then you must take care to create universal versions of those libs, as the ZOO-Kernel will try to create a universal binary. If you are not following this advice, you might receive compile errors of ``symbol(s) not found for architecture ppc`` or ``file was built for unsupported file format which is not the architecture being linked (ppc)``.
fr: Si vous utilisez vos propres bibliothèques (celles qui ne sont pas par défaut sur votre système) alors vous devez faire attention à créer des versions universelles de ces bibliothèques, comme le ZOO-Kernel essayera de créer un binaire universel. Si vous ne suivez pas ce conseil, vous risquez de recevoir des erreurs de compilation du type ``symbol(s) not found for architecture ppc`` ou ``file was built for unsupported file format which is not the architecture being linked (ppc)``.

source: Deploy the OGR Services Provider
fr: Déployer le fournisseur de services OGR

source: Requirements
fr: Prérequis

source: Before your try to use any service, please set the correct path in the ``main.cfg`` for tmpPath and tmpUrl.
fr: Avant que vous essayiez d'utiliser un service quel qui soit, merci de définir le chemin correct dans le ``main.cfg`` pour tmpPath et tmpUrl.

source: You can use the following setup :
fr: Vous pouvez utiliser la configuration suivante :

source: Obviously you'll then need to create this directory, using the following command :
fr: Evidemment vous aurez besoin de créer ce répertoire, en utilisant la commande suivante :

source: C Version
fr: Version C

source: To compile the base-vect-ops ServicesProvider you'll need to edit the Makefile in *zoo/zoo-services/ogr/base-vect-ops/* directory. Add "-I/Library//Frameworks/GEOS.framework/Versions/3/Headers/" to the CFLAGS value on the first line. To compile, add GDAL framework to the PATH environmenet variable, to ensure that gdal-config tool will be found, run make and then copy cgi-env files in the /Library/WebServer/CGI-Executables directory.
fr: Pour compiler le ServicesProvider de base-vect-ops, vous aurez besoin d'éditer le Makefile dans le répertoire *zoo/zoo-services/ogr/base-vect-ops/*. Ajoutez "-I/Library//Frameworks/GEOS.framework/Versions/3/Headers/" à la valeur CFLAGS sur la première ligne. Pour compiler, ajoutez le framework GDAL à votre variable d'environnement PATH, pour vous assurer que l'outil gdal-config sera trouvé, lancez make et ensuite copiez les fichiers cgi-env dans le répertoire /Library/WebServer/CGI-Executables.

source: You can test using this `url <http://localhost/cgi-bin/zoo_loader.cgi?request=Execute&service=WPS&version=1.0.0&Identifier=Buffer&DataInputs=BufferDistance=1@datatype=interger;InputPolygon=Reference@xlink:href=http%3A%2F%2Fwww.zoo-project.org%3A8082%2Fgeoserver%2Fows%3FSERVICE%3DWFS%26REQUEST%3DGetFeature%26VERSION%3D1.0.0%26typename%3Dtopp%3Astates%26SRS%3DEPSG%3A4326%26FeatureID%3Dstates.15>`__ if everything is ok with your setup.
fr: Vous pouvez tester en utilisant cette `url <http://localhost/cgi-bin/zoo_loader.cgi?request=Execute&service=WPS&version=1.0.0&Identifier=Buffer&DataInputs=BufferDistance=1@datatype=interger;InputPolygon=Reference@xlink:href=http%3A%2F%2Fwww.zoo-project.org%3A8082%2Fgeoserver%2Fows%3FSERVICE%3DWFS%26REQUEST%3DGetFeature%26VERSION%3D1.0.0%26typename%3Dtopp%3Astates%26SRS%3DEPSG%3A4326%26FeatureID%3Dstates.15>`__ si tout est ok avec la configuration.

source: Python Version
fr: Version de Python

source: **Requirements**
fr: **Prérequis**

source: First of all run python from a Terminal.app and try the following import from the python interpreter :
fr: En tout premier, lancez python depuis la Terminal.app et essayer l'import suivant depuis l'interpréteur python :

source: If you get an issue when importing the libxml2 module from your python interpreter then that means you need to install the Python support for the libxml2 library which is already installed on your Mac OS X environment. To accomplish this, you have first to determine what version of libxml2 is installed on your platform, using the following command:
fr: Si vous avez un problème lors de l'importation du module libxml2 depuis votre interpréteur python alors cela signifie que vous avez besoin d'installer le support Python pour la bibliothèque libxml2 qui est déjà installée sur votre environnement Mac OS X. Pour accomplir cela, vous devez en premier déterminer quelle version de libxml2 est installée sur votre plate-forme, en utilisant la commande suivante:

source: Download the source corresponding to your version (i.e. on 10.6.6 you get 2.7.3) from the libxml2 `download page <ftp://xmlsoft.org/libxml2/>`__ into your ``src`` directory then uncompress it.
fr: Téléchargez la source correspondante à votre version (c'est à dire sur 10.6.6 vous aurez 2.7.3) depuis la `page de téléchargement <ftp://xmlsoft.org/libxml2/>`__ libxml2 dans votre répertoire ``src`` puis la décompresser.

source: Use the following command to install the python support :
fr: Utilisez la commande suivante pour installer le support python :

source: **Deploy OGR Python Services Provider**
fr: **Déployer le fournisseur de services Python OGR**

source: Now copy the ``zoo-services/ogt/base-vect-ops/cgi-env`` files into ``/Library/WebServer/CGI-Executables``.
fr: Maintenant copiez les fichiers ``zoo-services/ogt/base-vect-ops/cgi-env`` dans ``/Library/WebServer/CGI-Executables``.

source: You can test using this `url <http://localhost/cgi-bin/zoo_loader.cgi?request=Execute&service=WPS&version=1.0.0&Identifier=BufferPy&DataInputs=BufferDistance=1@datatype=interger;InputPolygon=Reference@xlink:href=http%3A%2F%2Fwww.zoo-project.org%3A8082%2Fgeoserver%2Fows%3FSERVICE%3DWFS%26REQUEST%3DGetFeature%26VERSION%3D1.0.0%26typename%3Dtopp%3Astates%26SRS%3DEPSG%3A4326%26FeatureID%3Dstates.15>`__ if everything is ok with your setup.
fr: Vous pouvez tester en utilisant cette `url <http://localhost/cgi-bin/zoo_loader.cgi?request=Execute&service=WPS&version=1.0.0&Identifier=BufferPy&DataInputs=BufferDistance=1@datatype=interger;InputPolygon=Reference@xlink:href=http%3A%2F%2Fwww.zoo-project.org%3A8082%2Fgeoserver%2Fows%3FSERVICE%3DWFS%26REQUEST%3DGetFeature%26VERSION%3D1.0.0%26typename%3Dtopp%3Astates%26SRS%3DEPSG%3A4326%26FeatureID%3Dstates.15>`__ si tout est ok avec votre configuration.

source: Test using Local Demo Page
fr: Test utilisant la page de démo locale

source: Download the `OpenLayers <http://openlayers.org>`__ library and uncompress it in your personal Sites directory (located in your home directory).
fr: Téléchargez la bibliothèque `OpenLayers <http://openlayers.org>`__ et la décompresser dans votre répertoire de Sites personnel (situé dans votre répertoire home).

source: Rename the OpenLayers directory as openlayers.
fr: Renommez le répertoire OpenLayers comme openlayers.

source: Download this `zip archive <http://www.zoo-project.org/trac/raw-attachment/wiki/ZooDocumentation/ZOOKernel/MacOSX_installation/zoo-demo.zip>`__ and then uncompress it in your personal Sites directory.
fr: Téléchargez cette `archive zip <http://www.zoo-project.org/trac/raw-attachment/wiki/ZooDocumentation/ZOOKernel/MacOSX_installation/zoo-demo.zip>`__ et ensuite la décompresser dans votre répertoire de Sites personnel.

source: Load your local demo pages using urls similar to the following (replacing MyUserName by your MacOS user name) :
fr: Chargez vos pages de démo locales en utilisant des urls similaires à ce qui suit (en remplaçant MyUserName par votre nom d'utilisateur MacOS) :
