Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/kernel/install-centos.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: This documentation was created thanks to Guillaume Sueur from Neogeo Technologies which took time to test installing the ZOO-Kernel on a CentOS 5.5 environment.
fr: Cette documentation a été créée grâce à Guillaume Sueur de Neogeo Technologies qui a pris le temps de tester l'installation du ZOO-Kernel sur un environnement CentOS 5.5.

source: Requirements
fr: Prérequis

source: Install some standard tools to be able to run ZOO-Kernel on your platform :
fr: Installez quelques outils standards pour être capable de faire fonctionner le ZOO-Kernel sur votre plateforme :

source: Compile then install FastCGI library from source
fr: Compilez puis installez la bibliothèque FastCGI depuis les sources

source: Compile then install the autoconf tools :
fr: Compilez puis installez les outils autoconf :

source: Compile then install the flex tool :
fr: Compilez puis installez l'outil flex :

source: Using the curl provided in the CentOS distribution will produce a ZOO-Kernel unable to run any Service. Indeed, some segmentation faults occur when trying to run ``Execute`` requests on the ZOO-Kernel, compiling the ZOO-Kernel setting ``USE_GDB`` flag in the ``CFLAGS`` of your ``Makefile`` will let you run ZOO-Kernel from gdb and be able to get more information on what is going wrong with your ZOO-Kernel. Doing this we can figure out that code on `line 173 <http://zoo-project.org/trac/browser/trunk/zoo-kernel/ulinet.c#L173>`__ and `line 175 <http://zoo-project.org/trac/browser/trunk/zoo-kernel/ulinet.c#L175>`__ have to be commented in the ``ulinet.c`` file to get a ZOO-Kernel working using the curl available in CentOS (curl version 7.15.5). If you don't apply the modification, you will get an error from a gdb session pointing segfault in ``Curl_cookie_clearall``.
fr: L'utilisation du curl fournit par la distribution CentOS produira un ZOO-Kernel incapable de faire fonctionner n'importe quel service. En effet, des erreurs de segmentation ont lieu quand on essaye de lancer des requêtes ``Execute`` sur le ZOO-Kernel. La compilation du ZOO-Kernel en configurant le flag ``USE_GDB`` dans les ``CFLAGS`` de votre ``Makefile`` vous permettra de lancer votre ZOO-Kernel depuis gdb et d'être capable d'avoir plus d'informations sur ce qui ne fonctionne pas correctement avec votre ZOO-Kernel. En faisant cela, nous pouvons déduire que le code sur la `ligne 173 <http://zoo-project.org/trac/browser/trunk/zoo-kernel/ulinet.c#L173>`__ et la `ligne 175 <http://zoo-project.org/trac/browser/trunk/zoo-kernel/ulinet.c#L175>`__ doit être commenté dans le fichier ``ulinet.c`` pour avoir un ZOO-Kernel fonctionnel en utilsant le curl disponible dans CentOS (curl version 7.15.5). Si vous n'appliquez pas la modification, vous aurez une erreur depuis la session gdb pointant une segfault dans ``Curl_cookie_clearall``.

source: You can optionally compile then install curl from source :
fr: Vous pouvez optionnellement compiler et installer curl depuis les sources:

source: Compile then install Python :
fr: Compilez puis installez Python :

source: Compile then install your own GDAL library :
fr: Compilez puis installez votre propre bibliothèque GDAL :

source: Install the Sun JAVA SDK into ``/usr/share`` then use the following command to ensure that the ``libjvm.so`` will be found at runtime from any context.
fr: Installez le SDK JAVA Sun dans ``/usr/share`` puis utilisez la commande suivante pour vous assurez que ``libjvm.so`` sera trouvé à l'exécution depuis n'importe quel contexte.

source: Compile ZOO-Kernel and ZOO-Services
fr: Compiler le ZOO-Kernel et les ZOO-Services

source: Compile then install ZOO-Kernel and your first ZOO-Services.
fr: Compilez puis installez le ZOO-Kernel votre premier ZOO-Services.

source: First of all, compile the cgic library providen in the SVN source tree:
fr: En tout premier, compilez la bibliothèque cgic fournie dans l'arborescence des sources SVN:

source: Compile then install ZOO-Kernel.
fr: Compilez puis installez le ZOO-Kernel.

source: Compile then deploy your first ZOO-ServicesProviders (simple HelloPy, line 1 and 2, and the OGR base-vect-ops ServiceProvider, line 3 to 6):
fr: Compilez puis déployez votre premier ZOO-ServicesProviders (un simple HelloPy, lignes 1 et 2, et le ServiceProvider OGR base-vect-ops, lignes 3 à 6):

source: To ensure that the ``libjvm.so`` will be found from apache, please restart it :
fr: Pour vous assurez que ``libjvm.so`` sera trouvé depuis apache, merci de le redémarrer :

source: Testing your ZOO-Kernel
fr: Tester votre ZOO-Kernel

source: Test your ZOO-Kernel from command line:
fr: Testez votre ZOO-Kernel en ligne de commande:
