Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/kernel/install-debian.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: An Ubuntu 10.4 with ZOO virtual image is available at http://www.zoo-project.org/Ubuntu10.4_ZOO.zip (root: ZOO.test)
fr: Une image virtuelle Ubuntu 10.4 incluant ZOO est disponible sur http://www.zoo-project.org/Ubuntu10.4_ZOO.zip (root: ZOO.test)

source: Ubuntu 12.04 dependencies
fr: Dépendances Ubuntu 12.04

source: install default dependencies
fr: installez les dépendances par défaut

source: add ubuntugis repository to obtain the newer GIS libraries
fr: ajoutez le dépôt ubuntugis pour obtenir les bibliothèques SIG les plus récentes

source: install geographic library
fr: installez une bibliothèque géographique

source: download ZOO source
fr: téléchargez les sources de ZOO

source: Debian 7.0 dependencies
fr: Dépendances Debian 7.0

source: install dependencies
fr: installez les dépendances

source: Installation Workflow
fr: Workflow d'installation

source: In the following lines you will find ``as administrator user`` note, on Ubuntu you have to add ``sudo`` at the beginning of line, on Debian you can use ``su -c COMMAND``)
fr: Dans les lignes suivantes, vous trouverez une note ``en tant qu'utilisateur administrateur``. Sur Ubuntu, vous devrez ajouter ``sudo`` au début de la ligne, sur Debian, vous pouvez utiliser ``su -c COMMAND``)

source: install cgic from packages
fr: installez cgic depuis les paquets

source: compile
fr: compilez

source: if you want use Mapserver (optional) for WMS, WFS and WCS output read :ref:`mapserver`
fr: Si vous voulez utiliser Mapserver (optionnel) pour des sorties WMS, WFS et WCS, lisez :ref:`mapserver`

source: go to kernel path
fr: allez au chemin du kernel

source: create configure file
fr: créez le fichier configure

source: run configure
fr: lancez configure

source: For PHP, you must make sure to compile PHP with `--enable-embed <http://www.zoo-project.org/trac/wiki/ZooKernel/Embed/PHP#ConfigureandInstallPHPEmbedlibrary>`__.
fr: Pour PHP, vous devez vous assurer d'avoir compilé PHP avec `--enable-embed <http://www.zoo-project.org/trac/wiki/ZooKernel/Embed/PHP#ConfigureandInstallPHPEmbedlibrary>`__.

source: To use MapServer add the option ``--with-mapserver=/path/to/mapserver/source``
fr: Pour utiliser MapServer, ajoutez l'option ``--with-mapserver=/path/to/mapserver/source``

source: copy necessary files into your cgi-bin (as administrator user)
fr: copiez les fichiers nécessaires dans votre cgi-bin (en tant qu'utilisateur administrateur)

source: install ZOO ServiceProvider, in this case we try Python service (as administrator user)
fr: installez le ServiceProvider ZOO, dans ce cas, nous essayons le service Python (en tant qu'utilisateur administrateur)

source: change some information in the main.cfg (as administrator user)
fr: changez quelques informations dans le main.cfg (en tant qu'utilisateur administrateur)

source: try the installation
fr: essayer l'installation

source: If you have some problem in the execute request using Python service, add the following to ``main.cfg``:
fr: Si vous avez des problèmes dans la requête execute utilisant le service Python, ajoutez ce qui suit à ``main.cfg``:

source: Rewrite rule configuration
fr: Réécrire la configuration des règles

source: for better readability and fully functional ZOO Kernel, you have to modify the default Apache configuration in order to be able to use the http://localhost/zoo/ url directly. Run (as administrator user)
fr: pour une meilleure lisibilité et un Kernel ZOO pleinement fonctionnel, vous devez modifier la configuration par défaut de Apache afin d'être capable d'utiliser l'url http://localhost/zoo/ directement. Lancez (en tant qu'utilisateur administrateur)

source: first, please create a ``zoo`` directory in ``/var/www/`` which is used by Apache as the DocumentRoot (as administrator user)
fr: d'abord, merci de créer un répertoire ``zoo`` dans ``/var/www/`` qui est utilisé par Apache en tant que DocumentRoot (en tant qu'utilisateur administrateur)

source: Then, please edit the ``/etc/apache2/sites-available/default`` configuration file and add the following lines after the Directory block related to /var/www directory (as administrator user)
fr: Ensuite, merci d'éditer le fichier de configuration ``/etc/apache2/sites-available/default`` et d'ajouter les lignes suivantes après le bloc Directory relatif au répertoire /var/www directory (en tant qu'utilisateur administrateur)

source: now create a small .htaccess file in the ``/var/www/zoo`` containing the following lines (as administrator user)
fr: maintenant, créez un petit fichier .htaccess dans le ``/var/www/zoo`` contenant les lignes suivantes (en tant qu'utilisateur administrateur)

source: for this last file to be taken into account by Apache, you must activate the rewrite Apache module by copying a load file as bellow (as administrator user)
fr: pour que le dernier fichier soit pris en compte par Apache, vous devez activer le module Apache de réécriture en copiant un fichier de chargement comme ci-dessous (en tant qu'utilisateur administrateur)

source: or using the a2enmod tool this way (as administrator user)
fr: ou en utilisant l'outil a2enmod de cette manière (en tant qu'utilisateur administrateur)

source: now you should be able to access the ZOO Kernel using a simplified by restarting your Apache Web server (as administrator user)
fr: maintenant, vous devriez être capable d'accéder au Kernel ZOO utilisant un script simplifié en redémarrant votre serveur Web Apache (en tant qu'utilisateur administrateur)

source: now you can try:
fr: maintenant vous pouvez essayer:

source: Compile MapServer
fr: Compiler MapServer

source: install MapServer dependencies (as administrator user)
fr: installez les dépendances MapServer (en tant qu'utilisateur administrateur)

source: extract MapServer from git repository
fr: extrayez MapServer depuis le dépôt git

source: now compile MapServer
fr: maintenant compilez MapServer

source: now install MapServer (as administrator user)
fr: maintenant installez MapServer (en tant qu'utilisateur administrateur)

source: now add path to libraries path (as administrator user)
fr: maintenant, ajoutez le chemin au chemin des bibliothèques (en tant qu'administrateur)

source: run as administrator
fr: lancez en tant qu'administrateur
