Repository: ThomasG77/zoo-project-docs
Catalog: locale/*/LC_MESSAGES/kernel/install-opensuse.po
Languages: fr

source: Table of Contents
fr: Table des matières

source: Zoo-Kernel is maintained as a package in `OpenSUSE Build Service (OBS) <https://build.opensuse.org/package/show?package=zoo-kernel&project=Application%3AGeo>`__. This way, rpm's are provided for all versions of openSUSE Linux (11.2, 11.3, 11.4, Factory).
fr: Le Zoo-Kernel est maintenu en tant que paquet dans `OpenSUSE Build Service (OBS) <https://build.opensuse.org/package/show?package=zoo-kernel&project=Application%3AGeo>`__. De cette manière, les rpm sont fournis pour toutes les versions de openSUSE Linux (11.2, 11.3, 11.4, Factory).

source: Stable Releases
fr: Versions stables

source: For installing Zoo-Kernel in openSUSE there are 3 ways available:
fr: Pour installer le Zoo-Kernel dans openSUSE, il y a 3 manières disponibles:

source: One Click Installer
fr: Installateur en un clic

source: One-click installer that can be found `here <http://software.opensuse.org/search?q=zoo-kernel&baseproject=openSUSE%3A11.4&lang=en&exclude_debug=true>`__. For openSUSE 11.4 this is the direct `link <http://software.opensuse.org/ymp/Application:Geo/openSUSE_11.4/zoo-kernel.ymp?base=openSUSE%3A11.4&query=zoo-kernel>`__.
fr: L'installateur en un clic peut être trouvé `ici <http://software.opensuse.org/search?q=zoo-kernel&baseproject=openSUSE%3A11.4&lang=en&exclude_debug=true>`__. Pour openSUSE 11.4, c'est le `lien direct <http://software.opensuse.org/ymp/Application:Geo/openSUSE_11.4/zoo-kernel.ymp?base=openSUSE%3A11.4&query=zoo-kernel>`__.

source: Yast Software Manager using a GUI
fr: Le gestionnaire de paquets YAST utilisant une interface graphique

source: The `Application:Geo <http://download.opensuse.org/repositories/Application:/Geo/>`__ repository has to be added to the Software Repositories and then Zoo-kernel can be found in Software Management through search.
fr: Le dépôt `Application:Geo <http://download.opensuse.org/repositories/Application:/Geo/>`__ doit être ajouté aux dépôts logiciels et ensuite, le Zoo-kernel peut être trouvé dans le gestionnaire de logiciels via une recherche.

source: Command line (as root for openSUSE 11.4)
fr: Ligne de commande (en tant que root pour openSUSE 11.4)

source: Unstable Version
fr: Version instable

source: The latest development version of ZOO-Kernel can be found in OBS under the project `home:tzotsos <https://build.opensuse.org/project/show?project=home%3Atzotsos>`__. ZOO-Kernel packages are maintained and tested there before being released to the Application:Geo repository.
fr: La dernière version de développement du ZOO-Kernel peut être trouvée dans OBS sous le projet `home:tzotsos <https://build.opensuse.org/project/show?project=home%3Atzotsos>`__. Les paquets du ZOO-Kernel sont maintenus et testés ici avant d'être mis à disposition sur le dépôt Application:Geo.

source: Installation methods are identical as the stable version. Make sure to use `this <http://download.opensuse.org/repositories/home:/tzotsos/>`__ repository instead.
fr: Les méthodes d'installation sont identiques à la version stable. Assurez-vous d'utiliser `ce dépôt <http://download.opensuse.org/repositories/home:/tzotsos/>`__ à la place.

source: Command line installation (as root for openSUSE 11.4)
fr: Installation en ligne de commande (en tant que root pour openSUSE 11.4)

source: Additionally, there is the option of adding the zoo-wps-grass-bridge package. This option will automatically install grass7 (svn trunk).
fr: En plus, il y a l'option d'ajouter le paquet zoo-wps-grass-bridge. Cette option installera automatiquement grass7 (svn trunk).

source: Try the Installation
fr: Essayer l'installation
